"""У созданного класса Person
1. посмотреть на уже определенные атрибуты.
2. Добавить какие-то поля.
3. Создать новый экземпляр класса.
4. Обратиться к именам полей через имя экземпляра класса, имя метода.
5. Рассмотреть отличия.
6. Попробовать изменять различными способами поля.
7. Удалить поля разными способами.
"""


""" ====== 1. посмотреть на уже определённые атрибуты. ====== """


""" ====== 2. Добавить какие-то поля. ====== """



""" ====== 3. Создать новый экземпляр класса. ====== """



""" ====== 4. Обратиться к именам полей через имя экземпляра класса, имя метода. ====== """



""" ====== 5. Рассмотреть отличия. ====== """


""" ====== 6. Попробовать изменять различными способами поля. ====== """


""" ====== 7. Удалить поля разными способами. """







