"""Напишите программу, которая принимает список чисел от пользователя и вставляет новое число в середину списка.
Затем программа должна удалить элемент из середины списка.

1.) Используйте методы insert() и remove() для вставки и удаления элементов.

2.) Попробуйте потом решить задачу без использования методов insert() и remove().

Выведите итоговый список на экран с помощью команды print.

Пример вывода:
Исходный список: [1, 2, 3, 4, 5]
Введите новое число: 10
Список после вставки: [1, 2, 10, 3, 4, 5]
Список после удаления: [1, 2, 3, 4, 5]
"""

lst = [1, 2, 3, 4, 5]
print(lst)
