"""Создайте абстрактный базовый класс Car и его дочерние классы WV и Toyota.
Определите необходимые атрибуты и методы для каждого класса.
Реализуйте методы, проверяющие работу созданных классов.

Абстрактный класс Car:
    Атрибуты:
        brand (марка автомобиля)
        model (модель автомобиля)
        year (год выпуска автомобиля)
    Методы:
        start_engine: метод выводит сообщение о запуске двигателя
            "Engine for car model WV Passat is started"
            ВАЖНО: этот метод НЕ переопределяется в дочерних классах!
        print_color: абстрактный метод, который должен быть переопределён в дочерних классах
            "The color for this model WV Passat is red."
Дочерние классы содержат дополнительный атрибут color (цвет)
"""



wv = WV('WV', 'Passat', 2024, 'red')
print(wv.start_engine())
print(wv.print_color())

t = Toyota('Toyota', 'Camry', 2024, 'green')
print(t.start_engine())
print(t.print_color())


# Engine for car model WV Passat is started
# The color for this model WV Passat 2024 is red.
# Engine for car model Toyota Camry is started
# The color for this model WV Passat 2024 is green.
