"""Написать функцию, которая возвращает True, если в массиве две двойки идут подряд.
[1, 2, 2] -> True,
[2, 1, 2] -> False
"""


def is_double_2_in_sequence(nums: list[int]) -> bool:

    return False


print(is_double_2_in_sequence([1, 2, 2]))  # True
print(is_double_2_in_sequence([2, 1, 2]))  # False
