"""Дан список чисел. Написать функция, которая возвращает кортеж из наибольшего элемента в списке и его индекса.
Если наибольших элементов несколько, выведите индекс первого из них.
"""


def get_max_and_index(nums: list[int]) -> tuple:
    return ...


print(get_max_and_index([1, 3, 7, 7, 5]))   # (7, 2)
