"""Написать функцию more_than_value, которая проверяет, действительно ли
все элементы списка больше заданной величины.
"""


def more_than_value(nums: list[int | float], value: int | float) -> bool:
    pass


lst = [2, 9, 4, 1, 12]
print(more_than_value(lst, 1))