"""Напишите функцию get_largest_string(), которая
 - принимает список строк
 - и возвращает наибольшую строку из списка.
Функция должна быть аннотирована с помощью аннотаций типов.
"""


def get_largest_string():
    pass


lst = ["apple", "banana", "pear", "grape", "orange"]
print(get_largest_string(lst))  # banana

