"""Даны два целых числа A и B (при этом A ≤ B).
Напишите функцию, которая печатает все числа от A до B включительно (в одну строку через пробел).
"""


def range_between_a_and_b(a: int, b: int) -> None:
    print()


range_between_a_and_b(5, 10)
