"""Напишите следующую задачу с использованием функции.
У вас есть целое число X.
Нужно написать программу, которая напечатает разницу между числом 21 и X, если X<=21
и напечатает удвоенную разницу 21 и X в противном случае.
"""


def diff_between_21_and_x(x: int) -> None:
    print()


diff_between_21_and_x(8)
diff_between_21_and_x(33)
