"""Дан текстовый файл "huge-text-file.txt".
Выясните, сколько уникальных слов содержится в этом файле.
(Предварительно
    - текст необходимо очистить от небуквенных символов
    - и перевести в нижний регистр.)

Пример:
Количество уникальных слов: 23842
"""

pass

print(f"Количество уникальных слов: {len(uniq_words)}")



