"""Имеется словарь my_dict. Пользователь вводит с клавиатуры ключ.
На экран выводится значение, соответствующее этому ключу, например:
    apple: 1
Необходимо также предусмотреть ситуацию, когда ключ введен ошибочно.
В этом случае необходимо предложить пользователю повторить попытку ввода и,
в качестве справки, вывести на экран пять любых ключей, например: 
    Ключ <dat> отсутствует в словаре.
    Вот несколько вариантов для справки:
    apple, banana, cherry, date, elderberry
"""''

my_dict = {
    "apple": 1,
    "banana": 2,
    "cherry": 3,
    "date": 4,
    "elderberry": 5,
    "fig": 6,
    "grape": 7
}


