"""В базе данных ich_edit три таблицы.
    Users с полями (id, name, age),
    Products с полями (pid, prod, quantity) и
    Sales с полями (sid, id, pid).

Написать мини-интерфейс к базе данных, который умеет выполнять разные команды.
Выбрать таблицу для запроса.

1. Предусмотреть возможность выбрать несколько таблиц.
Вывести результат их соединения, если это возможно, или сообщение об ошибке.

2. Выбрать одно поле из выбранной таблицы и искомое значение этого поля.
Вывести все подходящие строки.
"""

"""================= Домашнее Задание ===================
1. Доработать мини-интерфейс к базе данных, который был сделан на занятии. 
Новые возможности интерфейса:

2. Ввести список полей выбранной таблицы.
При вводе искомого значения добавить возможность выбора знака - 
найти записи, в которых выбранное поле больше, меньше или равно введенному значению.
"""

