"""Методы (и способы), добавляющие элементы в список"""

lst = [1, 2, 3]

""" 1. =============== append() =============== """
lst.append(4)
print(lst)  # [1, 2, 3, 4]


""" 2. =============== extend() =============== """
lst.extend([5, 6])
print(lst)  # [1, 2, 3, 4, 5, 6]


""" 3. =============== concatenation ( + ) =============== """
lst = lst + [7]
print(lst)  # [1, 2, 3, 4, 5, 6, 7]


""" 4. =============== insert() =============== """
lst.insert(len(lst), 8)
print(lst)  # [1, 2, 3, 4, 5, 6, 7, 8]

