"""Какому из базовых принципов ООП (
    A. Инкапсуляция
    B. Наследование
    C. Полиморфизм
    D. Абстракция
 ) соответствуют следующие пункты:

1. В умном доме для всех электроприборов имеется команда "Включить".
    Такая же операция есть у умной настольной лампы.

2. Умный чайник при получении команды "Включить" проверяет, есть ли в нём вода,
    и только при ее наличии начинает кипячение.

3. В умном доме команду "Включить" можно дать любому электроприбору,
и можно также дать команду "Включи мою любимую песню" колонке с голосовым помощником.
"""
