"""Решите задачу с помощью list comprehension:
Напишите функцию, которая принимает строку от пользователя и разбивает ее на отдельные слова.
Затем программа должна создать список, содержащий длину каждого слова в исходной строке.
"""


def length_of_each_word(text: str) -> list[int]:
    return ...


t = "Напишите функцию которая принимает строку от пользователя"
print(length_of_each_word(t))
