"""Написать программу, которая использует функции языка для работы
с регулярными выражениями и синтаксис регулярных выражений:
"""
"""1. Определите, содержит ли заданная строка набор данных символов (a-z, A-Z и 0-9)."""


"""2. Определите, содержит ли строка символ ‘a’, за которым следует ноль или более символов ‘b’"""

"""3. Определите, содержит ли строка символ ‘a’, за которым следует 1 или более символов ‘b’"""

"""4. Определите, содержит ли строка символ ‘a’, за которым следует 0 или 1 символ ‘b’.

5. Определите, содержит ли строка символ z.

6. Определите, содержит ли строка только буквы, цифры и символ подчеркивания.

7. Определите, начинается ли строка с заданного числа.

8. Напишите программу, которая удаляет нули (0) перед цифрами в IP адресе.
    Например, “192.01.001.10”  → “192.1.1.10”

9. Определите, содержит ли строка цифры в конце.

10. Найдите вхождения и позиции подстроки в строке.
    Пример: строка “Домашние задания, задания в классе, отпускные задания”,
    подстрока “задания”,
    вывод “задания” на 9:15, “задания” на 18:24, “задания” на 46:52.

11. Напишите программу, которая заменяет пробелы подчёркиваниями и обратно.

12. Частью URL часто является дата в формате 2016/09/02.
    Например, https://www.somesite.com/news/2024/01/22/article.html.
    Найдите все даты в URL такого вида.
    Вывод может выглядеть так [('2024', '01', '22')].

13. Напишите программу, которая конвертирует дату в формате yyyy-mm-dd в формат dd-mm-yyyy.

14. Напишите программу, которая отделяет и печатает цифры в заданной строке.
    Например, для строки "Ten 10, Twenty 20, Thirty 30" должно быть выведено 10, 20, 30.

15. Напишите программу, которая выводит все слова,
    начинающиеся на букву ‘a’ и ‘e’ в заданном предложении.

16. Напишите программу, которая печатает цифры и их позиции в заданной строке текста.

17. Напишите программу, которая сокращает Strasse на Str. в заданной строке,
    например, “Flensburger Strasse” → “Flensburger Str.”.

18. Напишите программу, которая заменяет все вхождения пробела, запятой или точки подчеркиванием.

19. Напишите программу, которая находит все слова длины 3 в заданном предложении.

20. Напишите программу, которая находит все слова длины 3, 4 и 5 символов
    в заданном предложении.

21. Напишите программу, которая превращает camel-case строку в snake-case строку,
    например, “ПайтонПрограммист” -> “пайтон_программист”.

22. Напишите программу, которая выводит значения между кавычками в строке.
    Например, "Python", "PHP", "Java" -> [‘Python’, ‘PHP’, ‘Java’].

23. Напишите программу, которая удаляет несколько идущих подряд пробелов из строки,
    заменяя их одним пробелом. “Hello     World” -> “Hello World”.

24. Напишите программу, которая удаляет все пробелы из строки.

25. Напишите программу, которая заменяет в тексте все слова,
    начинающиеся на ‘х’ или ‘f’ на звёздочки.
"""