"""Дано натуральное число N.
Написать функцию digits_sum(N), которая вычисляет сумму его цифр.
При решении этой задачи пользуемся рекурсией, а строки, списки, массивы и циклы не используем.
Пример digits_sum(179) = 17
"""


def digits_sum_non_tail(n):
    pass


print(digits_sum_non_tail(179))  # 17


def digits_sum_tail(n, accumulator=0):
    pass


print(digits_sum_tail(179))  # 17

