"""Дано слово, состоящее только из строчных латинских букв.
Проверьте с помощью рекурсии, является ли это слово палиндромом.
Выведите YES или NO.

Пример:
    is_palindrome("radar") вернёт Yes
    is_palindrome("abba")) вернёт No
    is_palindrome("yes"))  вернёт No
"""


def is_palindrome(word):
    pass


print(is_palindrome("radar"))  # Yes
print(is_palindrome("abba"))   # Yes
print(is_palindrome("yes"))    # No
