"""Дана последовательность целых чисел, заканчивающаяся числом 0.
Выведите эту последовательность в обратном порядке.
При решении этой задачи нельзя пользоваться массивами и прочими динамическими структурами данных,
а нужно пользоваться рекурсией.
"""


def recurse_reverse(num, accumulator=0):
    pass


print(recurse_reverse(1520))   # 251
