"""Напишите программу, которая считывает два числа от пользователя
и выполняет деление первого числа на второе.
Обработайте исключение ZeroDivisionError, которое может возникнуть при попытке деления на ноль.
В случае возникновения исключения, выведите сообщение об ошибке,
в противном случае выведите результат деления.
"""
txt = "Введите число: "

    # x, y = int(input(txt)),  int(input(txt))
    # print(x / y)
