"""Напишите программу, которая принимает список чисел от пользователя и создает новый список,
содержащий только положительные числа из исходного списка.
Проверку, является ли каждое значение числом, проводить не нужно.

Используйте списковые включения (list comprehensions) для создания нового списка.
Пример вывода:
Введите список чисел, разделенных пробелами: -2 5 -8 10 -1 0 7
Положительные числа из списка: [5, 10, 7]
"""


def get_positive(lst_str: str) -> list[int]:
    return []


print(get_positive("-2 5 -8 10 -1 0 7"))
