"""Дано натуральное число N. Вычислите сумму его цифр.

При решении этой задачи нельзя использовать строки, списки, массивы, циклы.

Задачу необходимо решить с помощью рекурсии.
"""


# ============== tail recursion =================
def sum_digits_tail(num, accumulator=0):
    pass


print(sum_digits_tail(246))  # 12


# ============== non tail recursion =================
def sum_digits_non_tail(num):
    pass


print(sum_digits_non_tail(246))  # 12
